load-tests/matAffar.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 7
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 7
      arrivalRate: 5
      rampTo: 3
      name: Ramp up load
    - duration: 7
      arrivalRate: 6
      rampTo: 4
      name: Spike phase
  # Enable the Playwright engine:
  engines:
    playwright: {}
  processor: "./flows2.cjs"
scenarios:
  - engine: playwright
    testFunction: "matAffarFlow"